Repository: learning-process/parallel_programming_course
Catalog: docs/locale/*/LC_MESSAGES/user_guide/api.po
Languages: ru

source: API Reference
ru: Справочник API

source: Runners Module
ru: Модуль выполнения

source: Functions
ru: Функции

source: Parameters
ru: Параметры

source: Returns
ru: Возвращаемые значения

source: Task Module
ru: Модуль задач

source: Typedefs
ru: Псевдонимы типов

source: Template Parameters
ru: Параметры шаблона

source: Enums
ru: Перечисления

source: Throws
ru: Исключения

source: Variables
ru: Переменные

source: Utility Module
ru: Вспомогательный модуль (модуль с утилитами)

source: Performance Module
ru: Модуль измерения производительности
