Repository: learning-process/parallel_programming_course
Catalog: docs/locale/*/LC_MESSAGES/user_guide/build.po
Languages: ru

source: Build the Project with ``CMake``
ru: Построение проекта с помощью системы сборки ``CMake``

source: Navigate to the project root.
ru: Перейдите в корень проекта.

source: **Configure the build**: ``Makefile``, ``.sln``, etc.
ru: **Конфигурация проекта**: ``Makefile``, ``.sln``, и т.д.

source: Optional: enable sanitizers for local debugging
ru: Дополнительно: включите санитайзеры для локальной отладки

source: *Help on CMake keys:*
ru: *Важные CMake ключи для конфигурации проекта:*

source: ``-D USE_FUNC_TESTS=ON`` enable functional tests.
ru: ``-D USE_FUNC_TESTS=ON`` включает функциональные тесты.

source: ``-D USE_PERF_TESTS=ON`` enable performance tests.
ru: ``-D USE_PERF_TESTS=ON`` включает тесты на производительность.

source: ``-D CMAKE_BUILD_TYPE=Release`` normal build (default).
ru: ``-D CMAKE_BUILD_TYPE=Release`` нормальная сборка (по умолчанию).

source: ``-D CMAKE_BUILD_TYPE=RelWithDebInfo`` recommended when using sanitizers or running ``valgrind`` to keep debug information.
ru: ``-D CMAKE_BUILD_TYPE=RelWithDebInfo`` рекомендуется при использовании санитайзеров или запуске ``valgrind`` для сохранения отладочной информации.

source: ``-D CMAKE_BUILD_TYPE=Debug`` for debugging sessions.
ru: ``-D CMAKE_BUILD_TYPE=Debug`` используется при отладке.

source: *A corresponding flag can be omitted if it's not needed.*
ru: *Ряд CMake флагов может быть выключен, если они не требуются для выполнения работы.*

source: **Build the project**:
ru: **Построение проекта**:

source: **Run tests**:
ru: **Запуск тестов**:

source: Prefer the helper runner described in ``User Guide → CI``.
ru: Рекомендуется использовать вспомогательный раннер, описанный в «Инструкция → CI».
