Repository: learning-process/parallel_programming_course
Catalog: docs/locale/*/LC_MESSAGES/user_guide/ci.po
Languages: ru

source: Continuous Integration (CI)
ru: Непрерывная интеграция

source: Overview
ru: Общие сведения

source: Your pull request must pass all required CI checks before review/merge. The pipeline validates formatting and static analysis, builds on all platforms, runs functional tests (threads and MPI), measures performance, builds docs, and publishes artifacts (coverage report, docs, scoreboard).
ru: Ваш pull request должен пройти все обязательные проверки CI перед ревью/слиянием. Конвейер проверяет форматирование и статический анализ, собирает проект на всех платформах, запускает функциональные тесты (потоки и MPI), измеряет производительность, собирает документацию и публикует артефакты (отчёт по покрытию, документация, табло).

source: High‑level pipeline
ru: Общая схема конвейера

source: Pre-commit checks (fast) — runs repository hooks on changed files; fix locally via ``pre-commit run -a``.
ru: Проверки pre-commit (быстро) — запускает хуки репозитория на изменённых файлах; исправляйте локально командой ``pre-commit run -a``.

source: Platform builds and tests (Ubuntu, macOS, Windows) — Ubuntu (GCC/Clang, amd64+arm), macOS (Clang), Windows (MSVC/Clang‑CL); functional tests via ``scripts/run_tests.py`` for threads (``--counts 1 2 3 4``; extended ``5 7 11 13``) and processes (MPI, ``--counts 1 2 3 4``).
ru: Сборки и тесты на платформах (Ubuntu, macOS, Windows) — Ubuntu (GCC/Clang, amd64+arm), macOS (Clang), Windows (MSVC/Clang‑CL); функциональные тесты через ``scripts/run_tests.py`` для потоков (``--counts 1 2 3 4``; расширенно ``5 7 11 13``) и процессов (MPI, ``--counts 1 2 3 4``).

source: Sanitizers (Ubuntu/Clang) — Address/UB/Leak; tests use ``PPC_ASAN_RUN=1`` to skip valgrind.
ru: Санитайзеры (Ubuntu/Clang) — Address/UB/Leak; тесты запускаются с ``PPC_ASAN_RUN=1`` для пропуска valgrind.

source: Coverage (Ubuntu/GCC) — ``-D USE_COVERAGE=ON`` + gcovr; publishes to Codecov and uploads ``cov-report`` (HTML).
ru: Покрытие (Ubuntu/GCC) — ``-D USE_COVERAGE=ON`` + gcovr; публикация в Codecov и загрузка артефакта ``cov-report`` (HTML).

source: Performance (perf) — ``scripts/generate_perf_results.sh`` produces ``build/perf_stat_dir``; uploads ``perf-stat`` (Linux) and ``perf-stat-macos`` (macOS).
ru: Производительность (perf) — ``scripts/generate_perf_results.sh`` формирует ``build/perf_stat_dir``; загружаются артефакты ``perf-stat`` (Linux) и ``perf-stat-macos`` (macOS).

source: Pages (docs and scoreboard) — builds Doxygen XML and Sphinx (EN+RU) + scoreboard; on ``master`` deploys with coverage to GitHub Pages.
ru: Pages (документация и табло) — сборка Doxygen XML и Sphinx (EN+RU) + табло; в ветке ``master`` деплой вместе с покрытием на GitHub Pages.

source: Security and static analysis — clang‑tidy on PRs (avoid ``NOLINT``/``IWYU pragma``), scheduled CodeQL (C++/Python) and OpenSSF Scorecard.
ru: Безопасность и статический анализ — clang‑tidy в PR (избегайте ``NOLINT``/``IWYU pragma``), плановые CodeQL (C++/Python) и OpenSSF Scorecard.

source: Diagram
ru: Схема

source: The pipeline is illustrated below (blocks may be collapsed in GitHub UI):
ru: Схема конвейера приведена ниже (в UI GitHub блоки могут сворачиваться):

source: CI pipeline (pre-commit → OS builds/tests → perf → pages)
ru: Конвейер CI (pre-commit → сборки/тесты на ОС → perf → pages)

source: Running tests locally
ru: Локальный запуск тестов

source: Use the ``scripts/run_tests.py`` helper. Common environment variables:
ru: Используйте вспомогательный скрипт ``scripts/run_tests.py``. Основные переменные окружения:

source: Number of threads (also exported as ``OMP_NUM_THREADS``).
ru: Количество потоков (также экспортируется в ``OMP_NUM_THREADS``).

source: Number of MPI processes to launch.
ru: Количество процессов MPI, которые нужно запустить.

source: Set to ``1`` when sanitizers are enabled to skip ``valgrind`` runs (default ``0``).
ru: Установите ``1``, если включены санитайзеры, чтобы пропустить запуск под ``valgrind`` (по умолчанию ``0``).

source: Set to ``1`` to disable test time limits (default ``0``).
ru: Установите ``1``, чтобы отключить ограничение времени тестов (по умолчанию ``0``).

source: Execution modes: - ``--running-type=threads`` — shared-memory backends (OpenMP/TBB/std::thread) - ``--running-type=processes`` — MPI tests - ``--running-type=performance`` — performance benchmarks (mirrors CI perf job)
ru: Режимы запуска: — ``--running-type=threads`` — backends с общей памятью (OpenMP/TBB/std::thread); — ``--running-type=processes`` — MPI‑тесты; — ``--running-type=performance`` — бенчмарки производительности (как в CI perf).

source: Examples:
ru: Примеры:

source: Options: - ``--counts`` runs tests for multiple thread/process counts sequentially. - ``--additional-mpi-args`` passes extra launcher flags (e.g., ``--oversubscribe``). - ``--verbose`` prints every executed command.
ru: Опции: — ``--counts`` запускает тесты последовательно для нескольких значений потоков/процессов; — ``--additional-mpi-args`` передаёт дополнительные флаги MPI‑ланчеру (например, ``--oversubscribe``); — ``--verbose`` печатает каждую выполняемую команду.

source: Coverage and sanitizers locally
ru: Санитайзеры и покрытие локально

source: Sanitizers (Linux): configure with ``-D ENABLE_ADDRESS_SANITIZER=ON`` (and optional UB/Leak), run tests with ``PPC_ASAN_RUN=1``.
ru: Санитайзеры (Linux): конфигурация с ``-D ENABLE_ADDRESS_SANITIZER=ON`` (и опционально UB/Leak), запуск тестов с ``PPC_ASAN_RUN=1``.

source: Coverage (Linux/GCC): configure with ``-D USE_COVERAGE=ON``, run tests, then generate HTML via ``gcovr`` (see CI ``gcc-build-codecov`` for command line).
ru: Покрытие (Linux/GCC): конфигурация с ``-D USE_COVERAGE=ON``, запуск тестов, затем генерация HTML через ``gcovr`` (см. команду в CI job ``gcc-build-codecov``).

source: Docs and scoreboard artifacts
ru: Артефакты: документация и табло

source: Docs: run Doxygen first (``doxygen Doxyfile``), then Sphinx EN/RU via CMake targets ``docs_gettext``, ``docs_update``, ``docs_html``.
ru: Документация: сначала запустите Doxygen (``doxygen Doxyfile``), затем Sphinx (EN/RU) через цели CMake ``docs_gettext``, ``docs_update``, ``docs_html``.

source: Scoreboard: generate perf stats (``scripts/generate_perf_results.sh``) and build scoreboard target or use ``python3 scoreboard/main.py`` locally.
ru: Табло: сформируйте статистику (``scripts/generate_perf_results.sh``) и соберите цель табло или воспользуйтесь локально ``python3 scoreboard/main.py``.

source: Troubleshooting
ru: Диагностика и решения

source: Pre-commit fails: run ``pre-commit run -a`` locally (install with ``pre-commit install``) and commit fixes.
ru: Падает pre-commit: запустите локально ``pre-commit run -a`` (предварительно ``pre-commit install``) и закоммитьте исправления.

source: Static analysis (clang-tidy) fails: address comments; do not use ``NOLINT``/``IWYU pragma`` in task code.
ru: Падает статический анализ (clang-tidy): поправьте замечания; не используйте ``NOLINT``/``IWYU pragma`` в коде задач.

source: Tests not found/not running: verify ``settings.json`` enables required technologies and tests exist; see :doc:`submit_work`.
ru: Тесты не находятся/не запускаются: проверьте, что в ``settings.json`` включены нужные технологии и тесты существуют; см. :doc:`submit_work`.

source: Time limits exceeded: reduce data sizes; prefer env vars (:doc:`environment_variables`) like ``PPC_TASK_MAX_TIME``/``PPC_PERF_MAX_TIME``; avoid sleeps/randomness.
ru: Превышены лимиты времени: уменьшите объёмы данных; используйте переменные окружения (:doc:`environment_variables`) вроде ``PPC_TASK_MAX_TIME``/``PPC_PERF_MAX_TIME``; избегайте задержек/случайностей.

source: MPI runs fail locally: set ``PPC_NUM_PROC`` and try ``--additional-mpi-args=\"--oversubscribe\"``.
ru: Проблемы с локальным запуском MPI: задайте ``PPC_NUM_PROC`` и попробуйте ``--additional-mpi-args="--oversubscribe"``.

source: Docs build fails: fix RST warnings; run ``doxygen Doxyfile`` before Sphinx targets.
ru: Проблемы со сборкой документации: исправьте предупреждения RST; перед целями Sphinx выполните ``doxygen Doxyfile``.

source: Performance job fails: ensure exactly two perf tests (``task`` and ``pipeline``) and keep durations within limits.
ru: Падает job производительности: убедитесь, что ровно два перфтеста (``task`` и ``pipeline``) и длительность в пределах лимитов.

source: Local clang-tidy and gcovr examples
ru: Примеры локального clang-tidy и gcovr

source: clang-tidy (static analysis):
ru: clang-tidy (статический анализ):

source: gcovr (coverage, GCC):
ru: gcovr (покрытие, GCC):

source: Tooling tips (versions and install)
ru: Подсказки по инструментам (версии и установка)

source: clang-tidy version - CI uses clang-tidy 21. Prefer the same locally to avoid mismatches. - The helper may be named ``clang-tidy-21`` or ``run-clang-tidy-21`` on some systems.
ru: Версия clang-tidy — в CI используется clang-tidy 21. Локально лучше использовать ту же версию, чтобы избежать расхождений. На некоторых системах помощник может называться ``clang-tidy-21`` или ``run-clang-tidy-21``.

source: Linux - clang-tidy: install from your distro (e.g., ``apt install clang-tidy-21``) or use the course Docker image. - gcovr: ``python3 -m pip install gcovr`` or a distro package. - GCC version: use ``gcov-14`` when building with GCC 14 (as in CI).
ru: Linux — clang-tidy: установите из репозитория дистрибутива (например, ``apt install clang-tidy-21``) или используйте Docker‑образ курса. gcovr: ``python3 -m pip install gcovr`` либо пакет дистрибутива. GCC: при сборке с GCC 14 используйте ``gcov-14`` (как в CI).

source: macOS - clang-tidy: ``brew install llvm``; binary at ``$(brew --prefix)/opt/llvm/bin/clang-tidy``. - Optionally add LLVM to PATH or invoke with full path. - gcovr: ``python3 -m pip install gcovr`` or ``brew install gcovr``.
ru: macOS — clang-tidy: ``brew install llvm``; бинарник: ``$(brew --prefix)/opt/llvm/bin/clang-tidy``. При необходимости добавьте LLVM в PATH или вызывайте по полному пути. gcovr: ``python3 -m pip install gcovr`` или ``brew install gcovr``.

source: Windows - clang-tidy: install LLVM (Clang) or use ``choco install llvm``; ensure ``clang-tidy.exe`` is in PATH. - gcovr: ``py -m pip install gcovr``. - Coverage is primarily supported in our CI on Linux/GCC; prefer generating reports on Linux.
ru: Windows — clang-tidy: установите LLVM (Clang) или ``choco install llvm``; убедитесь, что ``clang-tidy.exe`` доступен в PATH. gcovr: ``py -m pip install gcovr``. Покрытие в основном поддерживается нашим CI на Linux/GCC — предпочтительнее генерировать отчёты на Linux.
