Repository: learning-process/parallel_programming_course
Catalog: docs/locale/*/LC_MESSAGES/user_guide/environment.po
Languages: ru

source: Set Up Your Environment
ru: Настройка окружения

source: Development Container (Recommended)
ru: Контейнер разработки (Рекомендуется)

source: The easiest way to set up your development environment is using the provided ``.devcontainer`` configuration with VS Code and Docker.
ru: Самый простой способ настроить среду разработки - использовать предоставленную конфигурацию ``.devcontainer`` с VS Code и Docker.

source: **Prerequisites:**
ru: **Требования:**

source: `Dev Containers extension <https://marketplace.visualstudio.com/items?itemName=ms-vscode-remote.remote-containers>`_
ru: `Расширение Dev Containers <https://marketplace.visualstudio.com/items?itemName=ms-vscode-remote.remote-containers>`_

source: **Setup:**
ru: **Настройка:**

source: Clone the repository and open it in VS Code
ru: Клонируйте репозиторий и откройте его в VS Code

source: When prompted, click "Reopen in Container" or use Command Palette: ``Dev Containers: Reopen in Container``
ru: При появлении запроса нажмите "Reopen in Container" или используйте палитру команд: ``Dev Containers: Reopen in Container``

source: VS Code will automatically build the container with all dependencies pre-installed
ru: VS Code автоматически соберет контейнер со всеми предустановленными зависимостями

source: The container includes:
ru: Контейнер включает:

source: Ubuntu environment with gcc-14, CMake, MPI, OpenMP
ru: Окружение Ubuntu с gcc-14, CMake, MPI, OpenMP

source: Pre-configured C++ and Python development tools
ru: Предварительно настроенные инструменты разработки C++ и Python

source: All project dependencies ready to use
ru: Все зависимости проекта готовы к использованию

source: This provides a consistent development environment across all platforms without manual dependency installation.
ru: Это обеспечивает единообразную среду разработки на всех платформах без ручной установки зависимостей.

source: Manual Setup
ru: Ручная настройка

source: If you prefer manual setup or cannot use containers, follow the instructions below.
ru: Если вы предпочитаете ручную настройку или не можете использовать контейнеры, следуйте инструкциям ниже.

source: Build prerequisites
ru: Требования к сборке

source: **Windows**: Download and install CMake from https://cmake.org/download (select the Windows installer) or install using Chocolatey:
ru: **Windows**: Загрузите и установите CMake с https://cmake.org/download (выберите установщик для Windows) или установите с помощью Chocolatey:

source: **Linux (Ubuntu/Debian)**: Install using package manager:
ru: **Linux (Ubuntu/Debian)**: Установите с помощью менеджера пакетов:

source: **macOS**: Install using Homebrew:
ru: **macOS**: Установите с помощью Homebrew:

source: Code Style Analysis
ru: Анализ стиля кодирования

source: Please follow the `Google C++ Style Guide <https://google.github.io/styleguide/cppguide.html>`_.
ru: Пожалуйста пройдите по ссылке для изучения стиля кодирования - `Google C++ Style Guide <https://google.github.io/styleguide/cppguide.html>`_.

source: Code style is checked using the `clang-format <https://clang.llvm.org/docs/ClangFormat.html>`_ tool.
ru: Проверка стиля кода выполняется с помощью инструмента `clang-format <https://clang.llvm.org/docs/ClangFormat.html>`_.

source: Optional tools (clang-tidy, gcovr)
ru: Дополнительные инструменты (clang-tidy, gcovr)

source: Install these to match the CI toolchain for static analysis and coverage reports.
ru: Установите их, чтобы соответствовать инструментам CI для статического анализа и отчётов по покрытию.

source: Parallel Programming Technologies
ru: Технологии параллельного программирования

source: `Installers link <https://www.microsoft.com/en-us/download/details.aspx?id=105289>`_. You have to install ``msmpisdk.msi`` and ``msmpisetup.exe``.
ru: `Ссылка на установку <https://www.microsoft.com/en-us/download/details.aspx?id=105289>`_. Вы должны установить 2 файла - ``msmpisdk.msi`` и ``msmpisetup.exe``.

source: ``OpenMP`` is included in ``gcc`` and ``msvc``, but some components should be installed additionally:
ru: ``OpenMP`` в большинстве случаев включен в компиляторы ``gcc`` и ``msvc``, но ряд компонент все равно должны быть установлены дополнительно:

source: **Windows (MSVC)**, **Linux (gcc and clang)**, **MacOS (apple clang)**: Build as 3rdparty in the current project.
ru: **Windows (MSVC)**, **Linux (gcc and clang)**, **MacOS (apple clang)**: Данная библиотека строится как внешняя в составе текущего проекта и не требует дополнительных операций.

source: ``std::thread`` is included in STL libraries.
ru: ``std::thread`` включена в состав STL библиотек.
