Repository: learning-process/parallel_programming_course
Catalog: docs/locale/*/LC_MESSAGES/user_guide/submit_work.po
Languages: ru

source: How to create, open, and submit your work
ru: Как создать, открыть и отправить на проверку вашу работу

source: This section reflects the current integration flow used in semester repositories. It is a practical, step-by-step checklist tailored for students.
ru: Этот раздел отражает актуальный процесс интеграции для семестровых репозиториев. Это практический, пошаговый чек‑лист для студентов.

source: Repository and branch
ru: Репозиторий и ветка

source: Fork the semester repository for your group (processes/threads, program).
ru: Сделайте форк семестрового репозитория вашей группы (процессы/потоки, направление).

source: Create a branch named exactly as your task folder: ``<last>_<initial>_<short>`` (e.g., ``nesterov_a_elem_vec_sum``).
ru: Создайте ветку, имя которой точно совпадает с папкой вашей задачи: ``<фамилия>_<инициал>_<краткое>`` (например, ``nesterov_a_elem_vec_sum``).

source: Prerequisites
ru: Предварительные требования

source: Install tools and dependencies (see ``User Guide → Environment``).
ru: Установите инструменты и зависимости (см. «Инструкция → Окружение»).

source: Verify you can configure and build the project locally with CMake.
ru: Убедитесь, что вы можете сконфигурировать и собрать проект локально с помощью CMake.

source: If you work from a fork, clone your fork and set the course repo as upstream.
ru: Если вы работаете из форка, клонируйте свой форк и добавьте основной репозиторий курса как upstream.

source: Task folder layout (unified)
ru: Структура папки задачи (единая)

source: Create a folder ``tasks/<last>_<initial>_<short>/`` with the following layout:
ru: Создайте папку ``tasks/<фамилия>_<инициал>_<краткое>/`` со следующей структурой:

source: ``common/include/common.hpp`` — shared type aliases and `BaseTask`:
ru: ``common/include/common.hpp`` — общие типы и `BaseTask`:

source: Technology implementations (add only those required by the semester): - Processes (MPI/SEQ): ``seq/include``, ``seq/src``, ``mpi/include``, ``mpi/src`` - Threads: ``seq``, ``omp``, ``tbb``, ``stl`` (same include/src split)
ru: Реализации технологий (добавляйте только нужные в семестре): — Процессы (MPI/SEQ): ``seq/include``, ``seq/src``, ``mpi/include``, ``mpi/src`` — Потоки: ``seq``, ``omp``, ``tbb``, ``stl`` (аналогичное разделение include/src)

source: Each implementation defines a class derived from ``BaseTask`` and overrides ``ValidationImpl``, ``PreProcessingImpl``, ``RunImpl``, ``PostProcessingImpl``. Also add:
ru: Каждая реализация определяет класс, унаследованный от ``BaseTask``, и переопределяет ``ValidationImpl``, ``PreProcessingImpl``, ``RunImpl``, ``PostProcessingImpl``. Также добавьте:

source: Minimal skeleton (example for SEQ):
ru: Минимальный скелет (пример для SEQ):

source: Tests (unified location): - ``tests/functional/main.cpp`` — functional tests built on ``ppc::util::BaseRunFuncTests`` and helpers. - ``tests/performance/main.cpp`` — performance tests built on ``ppc::util::BaseRunPerfTests`` + ``MakeAllPerfTasks``.
ru: Тесты (единое размещение): — ``tests/functional/main.cpp`` — функциональные тесты на базе ``ppc::util::BaseRunFuncTests`` и вспомогательных функций. — ``tests/performance/main.cpp`` — тесты производительности на базе ``ppc::util::BaseRunPerfTests`` + ``MakeAllPerfTasks``.

source: Functional tests example:
ru: Пример функциональных тестов:

source: Use ``PPC_ID_<task_id>`` to resolve resources from ``data/`` when needed.
ru: При необходимости используйте ``PPC_ID_<task_id>`` для доступа к ресурсам из ``data/``.

source: Performance tests example:
ru: Пример тестов производительности:

source: Tips for tests
ru: Советы по тестам

source: Keep tests deterministic and under time limits; prefer env vars (see ``User Guide → Environment Variables``) over sleeps.
ru: Делайте тесты детерминированными и укладывающимися в лимиты времени; используйте переменные окружения (см. «Инструкция → Переменные окружения») вместо задержек.

source: Use ``PPC_ID_<task_id>`` to access files from ``data/``.
ru: Используйте ``PPC_ID_<task_id>`` для доступа к файлам из ``data/``.

source: Cover edge cases in functional tests; add exactly two performance test styles (``task`` and ``pipeline``) inside the suite.
ru: Покрывайте крайние случаи в функциональных тестах; добавьте ровно два стиля перфтестов (``task`` и ``pipeline``) внутри набора.

source: ``data/`` — optional input files for tests (e.g., images).
ru: ``data/`` — опциональные входные файлы для тестов (например, изображения).

source: ``settings.json`` — enable required technologies for your semester, e.g.:
ru: ``settings.json`` — включение необходимых технологий для вашего семестра, например:

source: ``info.json`` — student metadata used in automation (scoreboard, macros):
ru: ``info.json`` — данные студента для автоматизации (scoreboard, макросы):

source: Build and local run
ru: Сборка и локальный запуск

source: Configure and build:
ru: Конфигурация и сборка:

source: Run tests via helper:
ru: Запуск тестов через вспомогательный скрипт:

source: Executables (where to find tests)
ru: Исполняемые файлы (где искать тесты)

source: ``build/bin`` (or ``install/bin``): - ``core_func_tests`` — core library tests first - ``ppc_func_tests`` — functional tests for all tasks/technologies - ``ppc_perf_tests`` — performance tests for all tasks/technologies
ru: Исполняемые файлы генерируются в ``build/bin`` (или ``install/bin`` при установке): - ``core_func_tests`` — тесты ядра библиотеки - ``ppc_func_tests`` — функциональные тесты для всех задач/технологий - ``ppc_perf_tests`` — тесты производительности для всех задач/технологий

source: The runner applies gtest filters automatically to select technology suites.
ru: Runner автоматически применяет gtest‑фильтры для выбора наборов тестов по технологиям.

source: Title format (example):
ru: Формат заголовка (пример):

source: Description should include: - Полное описание задачи; номер варианта; используемая технология - Краткое описание реализации и отчёта - Чек-лист (CI зелёный в форке, clang-format/clang-tidy пройдены, функциональные/перф тесты ок, ветка названа как директория задачи, достоверность сведений).
ru: Описание должно включать: — Полное описание задачи; номер варианта; используемую технологию — Краткое описание реализации и отчёта — Чек‑лист (CI зелёный в форке, clang‑format/clang‑tidy пройдены, функциональные/перф‑тесты ок, ветка названа как директория задачи, достоверность сведений).

source: PR checklist template (body)
ru: Шаблон PR (чек‑лист)

source: Common pitfalls (read before pushing)
ru: Частые ошибки (прочтите перед отправкой)

source: Wrong folder/branch name. Must be ``<last>_<initial>_<short>`` everywhere.
ru: Неверное имя папки/ветки. Должно быть ``<фамилия>_<инициал>_<краткое>`` везде.

source: Missing or wrong ``GetStaticTypeOfTask`` value for a technology.
ru: Отсутствует или неверное значение ``GetStaticTypeOfTask`` для технологии.

source: Tests rely on randomness or sleeps instead of env time limits.
ru: Тесты зависят от случайности или задержек вместо лимитов по времени окружения.

source: ``settings.json`` doesn’t enable a required technology — tests won’t run.
ru: В ``settings.json`` не включена нужная технология — тесты не запустятся.

source: Namespace doesn’t match the folder name and collides with others.
ru: Namespace не соответствует имени папки и конфликтует с другими.

source: Performance tests count or naming deviates from the required patterns.
ru: Количество или именование перфтестов отклоняется от требуемых шаблонов.

source: Useful examples to reference
ru: Полезные примеры для ориентирования

source: Processes: ``tasks/example_processes``, ``tasks/example_processes_2``, ``tasks/example_processes_3``
ru: Процессы: ``tasks/example_processes``, ``tasks/example_processes_2``, ``tasks/example_processes_3``

source: Threads: ``tasks/example_threads``
ru: Потоки: ``tasks/example_threads``

source: Work from your fork in a dedicated branch (not ``master``). Branch name must match your task folder.
ru: Работайте из своего форка в отдельной ветке (не ``master``). Имя ветки должно совпадать с именем папки задачи.

source: Notes
ru: Примечания

source: All classes should live in a unique namespace (e.g., ``<last>_<initial>_<short>``).
ru: Все классы должны находиться в уникальном пространстве имён (например, ``<фамилия>_<инициал>_<краткое>``).

source: Keep tests deterministic and within time limits; prefer env vars over sleeps.
ru: Делайте тесты детерминированными и укладывающимися в лимиты времени; используйте переменные окружения вместо задержек.

source: Follow code style (clang-format/clang-tidy), and run pre-commit hooks locally.
ru: Соблюдайте стиль кода (clang-format/clang-tidy) и запускайте pre-commit локально.
