Repository: learning-process/parallel_programming_course
Catalog: docs/locale/*/LC_MESSAGES/common_information/introduction.po
Languages: ru

source: Introduction
ru: Вводная информация

source: Contacts
ru: Контакты

source: Alexander Nesterov — nesterov.alexander@outlook.com
ru: Александр Нестеров — nesterov.alexander@outlook.com

source: Arseniy Obolenskiy — me@gooddoog.ru
ru: Арсений Оболенский — me@gooddoog.ru

source: Practice
ru: Практика

source: We work online
ru: Работа происходит в режиме online

source: Use GitHub repository
ru: Используется GitHub репозиторий

source: Use Pull Requests
ru: Для задач задействуются Pull Request'ы

source: Merge into the master branch
ru: Рабочая git-ветка курса - master

source: Test verification
ru: Используются различные виды тестирования

source: Task distribution is random for each student.
ru: Распределение задач производится случайным образом для каждого человека

source: Full automation of quality and performance checks; plagiarism checks are applied.
ru: Полная автоматизация проверок качества и производительности; проводится проверка на плагиат.

source: Deadlines are set per task. See the penalties and grading rules in ``Points``.
ru: Дедлайны задаются на каждую задачу. Подробности в разделе ``Баллы``.

source: Examples are provided in ``tasks/example_threads`` and ``tasks/example_processes`` (and extended variations ``tasks/example_processes_2`` / ``tasks/example_processes_3``).
ru: Примеры размещены в ``tasks/example_threads`` и ``tasks/example_processes`` (а также расширенные варианты: ``tasks/example_processes_2`` / ``tasks/example_processes_3``).

source: In each repository, the README.md contains a link to the course documentation (**read it fully!!!**).
ru: В каждом из репозиториев в README.md находится документация курса (просьба читать полностью!!!)

source: Additionally, each repository includes an example of a properly formatted PULL REQUEST.
ru: Также в каждом репозитории представлен пример оформления PULL REQUEST'а

source: Submission of all tasks is mandatory to pass the course.
ru: Все задачи обязательны к выполнению

source: A task that has been merged into the master branch continues to be monitored. If a task fails in the master, it is disabled, and a record of this is added to the score table. All disabled tasks will result in a zero points result for those tasks at the end of the semester. It can be seen that your task is disabled due to the following reason: the directory of your task has been renamed from ``seq/nesterov_a_vector_sum`` to ``seq/nesterov_a_vector_sum_disabled``
ru: Задача, которая оказывается в мастер-ветке, продолжает проверяться. Если задача упала (падение теста) в мастере, она отключается, и запись об этом добавляется в таблицу результатов. Все отключенные (не исправленные) задания в конце семестра приведут к обнулению баллов за их выполнение. Можно увидеть, что ваша задача является отключенной, по следующему признаку: имя директории вашей задачи будет изменено с ``seq/nesterov_a_vector_sum`` на ``seq/nesterov_a_vector_sum_disabled``

source: Communication
ru: Коммуникации

source: Telegram channel — announcements and quick updates
ru: Канал в Telegram — объявления и быстрые обновления

source: GitHub Issues — repository problems and bug reports
ru: GitHub Issues — проблемы репозитория и отчёты об ошибках

source: Lessons — Q&A
ru: Занятия — вопросы и ответы

source: Feedback form — critical issues
ru: Форма обратной связи — критические вопросы

source: Email — non‑urgent matters
ru: Email — некритичные вопросы

source: Next steps
ru: Следующие шаги

source: Practice 1 (intro): task distribution, brief talk on parallelism, MPI examples
ru: Практика 1 (вводная): раздача вариантов, кратко о параллелизме, примеры MPI

source: Practice 2 (repo usage): repository checks and project structure walkthrough
ru: Практика 2 (работа с репозиторием): проверки, обзор структуры проекта

source: All resources for using the repository will be provided here:
ru: Все материалы по использованию репозитория будут представлены здесь:

source: `Git for half an hour: A Beginner’s Guide <https://proglib.io/p/git-for-half-an-hour>`__
ru: `Git за полчаса: руководство для начинающих <https://proglib.io/p/git-for-half-an-hour>`__

source: `Getting Started with Git and GitHub: A Beginner’s Guide <https://medium.com/nuances-of-programming/%D0%B7%D0%BD%D0%B0%D0%BA%D0%BE%D0%BC%D1%81%D1%82%D0%B2%D0%BE-%D1%81-git-%D0%B8-github-%D1%80%D1%83%D0%BA%D0%BE%D0%B2%D0%BE%D0%B4%D1%81%D1%82%D0%B2%D0%BE-%D0%B4%D0%BB%D1%8F-%D0%BD%D0%B0%D1%87%D0%B8%D0%BD%D0%B0%D1%8E%D1%89%D0%B8%D1%85-54ea2567d76c>`__
ru: `Знакомство с Git и GitHub: руководство для начинающих <https://medium.com/nuances-of-programming/%D0%B7%D0%BD%D0%B0%D0%BA%D0%BE%D0%BC%D1%81%D1%82%D0%B2%D0%BE-%D1%81-git-%D0%B8-github-%D1%80%D1%83%D0%BA%D0%BE%D0%B2%D0%BE%D0%B4%D1%81%D1%82%D0%B2%D0%BE-%D0%B4%D0%BB%D1%8F-%D0%BD%D0%B0%D1%87%D0%B8%D0%BD%D0%B0%D1%8E%D1%89%D0%B8%D1%85-54ea2567d76c>`__

source: `Git: A Quick Start Guide to Using Core Operations with Explanations <https://tproger.ru/translations/git-quick-start/>`__
ru: `Git. Быстрый старт по использованию основных операций с объяснениями <https://tproger.ru/translations/git-quick-start/>`__

source: `Conflicts resolving in Git <https://githowto.com/ru/resolving_conflicts>`__
ru: `Разрешение конфликтов в Git <https://githowto.com/ru/resolving_conflicts>`__

source: `Google testing framework (gtest) <https://habr.com/ru/post/119090/>`__
ru: `Фреймворк модульного тестирования Google (gtest) <https://habr.com/ru/post/119090/>`__

source: `GoogleTest Primer <https://github.com/google/googletest/blob/main/docs/primer.md>`__
ru: `Введение в GoogleTest <https://github.com/google/googletest/blob/main/docs/primer.md>`__

source: `GitHub Actions documentation <https://docs.github.com/ru/actions>`__
ru: `GitHub Actions документация <https://docs.github.com/ru/actions>`__

source: `Parallel Programming Technologies. Message Passing Interface (MPI) <https://parallel.ru/vvv/mpi.html#p1>`__
ru: `Технологии параллельного программирования. Message Passing Interface (MPI) <https://parallel.ru/vvv/mpi.html#p1>`__

source: `Typing and Layout in the System LaTeX <https://www.mccme.ru/free-books/llang/newllang.pdf>`__
ru: `Набор и вёрстка в системе LaTeX <https://www.mccme.ru/free-books/llang/newllang.pdf>`__

source: `LaTeX for the beginners <https://web.archive.org/web/20210420184700/http://www.docs.is.ed.ac.uk/skills/documents/3722/3722-2014.pdf>`__
ru: `LaTeX для начинающих <https://web.archive.org/web/20210420184700/http://www.docs.is.ed.ac.uk/skills/documents/3722/3722-2014.pdf>`__

source: `What is OpenMP? <https://parallel.ru/tech/tech_dev/openmp.html>`__
ru: `Что такое OpenMP? <https://parallel.ru/tech/tech_dev/openmp.html>`__

source: `TBB-1 <https://web.archive.org/web/20220406024622/http://www.unn.ru/pages/e-library/aids/2007/12.pdf>`__
ru: `Средства разработки параллельных программ для систем с общей памятью. Библиотека Intel Threading Building Blocks <https://web.archive.org/web/20220406024622/http://www.unn.ru/pages/e-library/aids/2007/12.pdf>`__

source: `Writing Multithreaded Applications in C++ <https://eax.me/cpp-multithreading/>`__
ru: `Написание многопоточных приложений на C++ <https://eax.me/cpp-multithreading/>`__

source: `Multithreading: New Features of the C++11 Standard <https://web.archive.org/web/20200608173050/http://www.quizful.net/post/multithreading-cpp11>`__
ru: `Многопоточность, новые возможности стандарта C++11 <https://web.archive.org/web/20200608173050/http://www.quizful.net/post/multithreading-cpp11>`__

source: `Introduction to Parallel Computing <http://ikt.muctr.ru/images/info/2Lecture_3.pdf>`__
ru: `Введение в параллельные вычисления <http://ikt.muctr.ru/images/info/2Lecture_3.pdf>`__

source: \* *All instructions, repositories, and tables may be updated during the learning process for better usability. Be prepared for changes, check and update them periodically!!!*
ru: \* *Все инструкции, репозитории и таблицы могут быть изменены в ходе учебного процесса для более удобного использования, будьте готовы к изменениям и периодически проверяйте это!!!!!!*
