Repository: learning-process/parallel_programming_course
Catalog: docs/locale/*/LC_MESSAGES/common_information/processes_tasks.po
Languages: ru

source: Processes parallelism tasks
ru: Задачи параллелизма на процессах

source: First task
ru: Первая задача

source: Variant Number
ru: Номер варианта

source: Task
ru: Задача

source: Sum of vector elements
ru: Сумма элементов вектора

source: Calculating the average value of vector elements
ru: Вычисление среднего значения элементов вектора

source: Maximum value of vector elements
ru: Максимальное значение элементов вектора

source: Minimum value of vector elements
ru: Минимальное значение элементов вектора

source: Finding the number of sign alternations between adjacent elements of the vector
ru: Нахождение числа чередований знаков значений соседних элементов вектора

source: Finding the number of order violations between adjacent elements of the vector
ru: Нахождение числа нарушений упорядоченности соседних элементов вектора

source: Finding the most similar adjacent elements of the vector
ru: Нахождение наиболее близких соседних элементов вектора

source: Finding the most different adjacent elements of the vector
ru: Нахождение наиболее отличающихся по значению соседних элементов вектора

source: Scalar product of vectors
ru: Скалярное произведение векторов

source: Sum of matrix elements
ru: Сумма элементов матрицы

source: Sum of values by rows in the matrix
ru: Сумма значений по строкам матрицы

source: Sum of values by columns in the matrix
ru: Сумма значений по столбцам матрицы

source: Maximum value of matrix elements
ru: Максимальное значение элементов матрицы

source: Minimum value of matrix elements
ru: Минимальное значение элементов матрицы

source: Finding maximum values by rows in the matrix
ru: Нахождение максимальных значений по строкам матрицы

source: Finding maximum values by columns in the matrix
ru: Нахождение максимальных значений по столбцам матрицы

source: Finding minimum values by rows in the matrix
ru: Нахождение минимальных значений по строкам матрицы

source: Finding minimum values by columns in the matrix
ru: Нахождение минимальных значений по столбцам матрицы

source: Integration – rectangle method
ru: Интегрирование – метод прямоугольников

source: Integration – trapezoidal method
ru: Интегрирование – метод трапеций

source: Integration – Monte Carlo method
ru: Интегрирование – метод Монте-Карло

source: Counting the number of alphabetical characters in a string
ru: Подсчет числа буквенных символов в строке

source: Counting the frequency of a character in a string
ru: Подсчет частоты символа в строке

source: Counting the number of words in a string
ru: Подсчет числа слов в строке

source: Counting the number of sentences in a string
ru: Подсчет числа предложений в строке

source: Checking lexicographical order of two strings
ru: Проверка лексикографической упорядоченности двух строк

source: Counting the number of differing characters between two strings
ru: Подсчет числа несовпадающих символов двух строк

source: Second task
ru: Вторая задача

source: Broadcast (one to all transfer)
ru: Передача от одного всем (broadcast)

source: Reduce (all to one transfer)
ru: Передача от всех одному (reduce)

source: Allreduce (all to one and broadcast)
ru: Передача от всех одному и рассылка (allreduce)

source: Scatter (one to all transfer)
ru: Обобщенная передача от одного всем (scatter)

source: Gather (all to one transfer)
ru: Обобщенная передача от всех одному (gather)

source: Line
ru: Линейка

source: Ring
ru: Кольцо

source: Star
ru: Звезда

source: Torus Grid
ru: Решетка-тор

source: Hypercube
ru: Гиперкуб

source: Horizontal strip scheme - matrix-vector multiplication
ru: Ленточная горизонтальная схема - умножение матрицы на вектор

source: Vertical strip scheme - matrix-vector multiplication
ru: Ленточная вертикальная схема - умножение матрицы на вектор

source: Horizontal strip scheme – partitioning only matrix A - matrix-matrix multiplication
ru: Ленточная горизонтальная схема - разбиение только матрицы А - умножение матрицы на матрицу

source: Horizontal strip scheme A, vertical strip scheme B - matrix-matrix multiplication
ru: Ленточная горизонтальная схема А, вертикальное В - умножение матрицы на матрицу

source: Gaussian method – horizontal strip scheme
ru: Метод Гаусса – ленточная горизонтальная схема

source: Gaussian method – vertical strip scheme
ru: Метод Гаусса – ленточная вертикальная схема

source: Gauss-Jordan method
ru: Метод Гаусса-Жордана

source: Iterative methods (Jacobi)
ru: Итеративные методы (Якоби)

source: Iterative methods (Gauss-Seidel)
ru: Итеративные методы (Зейделя)

source: Iterative methods (Simple)
ru: Метод простой итерации

source: Bubble sort (odd-even transposition algorithm)
ru: Сортировка пузырьком (алгоритм чет-нечетной перестановки)

source: Image smoothing
ru: Сглаживание изображения

source: Contrast enhancement
ru: Повышение контраста

source: Third task
ru: Третья задача

source: Dense matrix multiplication. Elements of data type double. Block scheme, Cannon's algorithm.
ru: Умножение плотных матриц. Элементы типа double. Блочная схема, алгоритм Кэннона.

source: Dense matrix multiplication. Elements of data type double. Block scheme, Fox's algorithm.
ru: Умножение плотных матриц. Элементы типа double. Блочная схема, алгоритм Фокса.

source: Dense matrix multiplication. Elements of data type double. Strassen's algorithm.
ru: Умножение плотных матриц. Элементы типа double. Алгоритм Штрассена.

source: Sparse matrix multiplication. Elements of data type double. Matrix storage format – row format (CRS).
ru: Умножение разреженных матриц. Элементы типа double. Формат хранения матрицы – строковый (CRS).

source: Sparse matrix multiplication. Elements of data type double. Matrix storage format – column format (CCS).
ru: Умножение разреженных матриц. Элементы типа double. Формат хранения матрицы – столбцовый (CCS).

source: Solving systems of linear equations using the conjugate gradient method.
ru: Решение систем линейных уравнений методом сопряженных градиентов.

source: Computing multidimensional integrals using a multistep scheme (rectangle method).
ru: Вычисление многомерных интегралов с использованием многошаговой схемы (метод прямоугольников).

source: Computing multidimensional integrals using a multistep scheme (trapezoidal method).
ru: Вычисление многомерных интегралов с использованием многошаговой схемы (метод трапеций).

source: Computing multidimensional integrals using a multistep scheme (Simpson's method).
ru: Вычисление многомерных интегралов с использованием многошаговой схемы (метод Симпсона).

source: Computing multidimensional integrals using the Monte Carlo method.
ru: Вычисление многомерных интегралов методом Монте-Карло.

source: Global search algorithm (Strongin's) for one-dimensional optimization problems. Parallelization by characteristics.
ru: Алгоритм глобального поиска (Стронгина) для одномерных задач оптимизации. Распараллеливание по характеристикам.

source: Multistep scheme for solving two-dimensional global optimization problems. Parallelization by dividing the search area.
ru: Многошаговая схема решения двумерных задач глобальной оптимизации. Распараллеливание путем разделения области поиска.

source: Multistep scheme for solving two-dimensional global optimization problems. Parallelization by characteristics.
ru: Многошаговая схема решения двумерных задач глобальной оптимизации. Распараллеливание по характеристикам.

source: Quick sort with simple merging.
ru: Быстрая сортировка с простым слиянием.

source: Quick sort with odd-even merging (Batcher's method).
ru: Быстрая сортировка с четно-нечетным слиянием Бэтчера.

source: Shell sort with simple merging.
ru: Сортировка Шелла с простым слиянием.

source: Shell sort with odd-even merging (Batcher's method).
ru: Сортировка Шелла с четно-нечетным слиянием Бэтчера.

source: Radix sort for integers with simple merging.
ru: Поразрядная сортировка для целых чисел с простым слиянием.

source: Radix sort for integers with odd-even merging (Batcher's method).
ru: Поразрядная сортировка для целых чисел с четно-нечетным слиянием Бэтчера.

source: Radix sort for floating-point numbers (type double) with simple merging.
ru: Поразрядная сортировка для вещественных чисел (тип double) с простым слиянием.

source: Radix sort for floating-point numbers (type double) with odd-even merging (Batcher's method).
ru: Поразрядная сортировка для вещественных чисел (тип double) с четно-нечетным слиянием Бэтчера.

source: Shortest path search from one vertex (Dijkstra's algorithm). With CRS graphs.
ru: Поиск кратчайших путей из одной вершины (алгоритм Дейкстры). С CRS формой хранения графа.

source: Shortest path search from one vertex (Bellman-Ford algorithm). With CRS graphs.
ru: Поиск кратчайших путей из одной вершины (алгоритм Беллмана-Форда). С CRS формой хранения графа.

source: Convex hull construction – Graham's scan.
ru: Построение выпуклой оболочки – проход Грэхема.

source: Convex hull construction – Jarvis's march.
ru: Построение выпуклой оболочки – проход Джарвиса.

source: Linear image filtering (horizontal partition). Gaussian kernel 3x3.
ru: Линейная фильтрация изображений (горизонтальное разбиение). Ядро Гаусса 3x3.

source: Linear image filtering (vertical partition). Gaussian kernel 3x3.
ru: Линейная фильтрация изображений (вертикальное разбиение). Ядро Гаусса 3x3.

source: Linear image filtering (block partition). Gaussian kernel 3x3.
ru: Линейная фильтрация изображений (блочное разбиение). Ядро Гаусса 3x3.

source: Edge detection in an image using the Sobel operator.
ru: Выделение ребер на изображении с использованием оператора Собеля.

source: Contrast enhancement of grayscale image using linear histogram stretching.
ru: Повышение контраста полутонового изображения посредством линейной растяжки гистограммы

source: Labeling components on a binary image (black areas correspond to objects, white to background).
ru: Маркировка компонент на бинарном изображении (черные области соответствуют объектам, белые – фону).

source: Convex hull construction for components of a binary image.
ru: Построение выпуклой оболочки для компонент бинарного изображения.

source: Comments for tasks 2 and 3:
ru: Комментарии для 2-ой и 3-й задач:

source: MESSAGE PASSING METHODS “You need to implement the specified methods using only the Send and Recv functions. The implemented function should have the same prototype as the corresponding MPI function. The test program should allow selecting the root process number and perform array transmission (broadcast, gather) for at least the following types: MPI_INT, MPI_FLOAT, MPI_DOUBLE. In all operations, the transmission should be carried out using the ‘tree’ of processes.”
ru: МЕТОДЫ ПЕРЕДАЧИ СООБЩЕНИЙ. Нужно реализовать указанные методы, используя только функции Send и Recv. Реализованная функция должна иметь тот же прототип, что и соответствующая функция MPI. Тестовая программа должна позволять выбрать номер процесса root и выполнять пересылку (рассылку, сбор) массива как минимум следующих типов: MPI_INT, MPI_FLOAT, MPI_DOUBLE. Во всех операциях передача должна выполняться с использованием "дерева" процессов.

source: Comments relevant for:
ru: Комментарии относятся к:

source: Variants for task 2
ru: Варинты для второй задачи

source: Variants for task 3
ru: Варинты для третьей задачи

source: DATA COMMUNICATION NETWORK TOPOLOGIES “You need to implement the virtual topology specified in the task using MPI capabilities for working with communicators and topologies, and ensure the ability to transfer data from any selected process to any other process. (Do not use MPI_Cart_Create and MPI_Graph_Create)”
ru: ТОПОЛОГИИ СЕТЕЙ ПЕРЕДАЧИ ДАННЫХ. Нужно реализовать указанную в задаче виртуальную топологию, используя возможности MPI по работе с коммуникаторами и топологиями и обеспечить возможность передачи данных от любого выбранного процесса любому другому процессу. (Не используя MPI_Cart_Create и MPI_Graph_Create)

source: Varinats for task 2
ru: Варинты для второй задачи

source: Varinats for task 3
ru: Варинты для третьей задачи

source: MATRIX COMPUTATIONS “In the horizontal scheme, the matrix is divided among processes by rows. In the vertical scheme, it is divided by columns, and in this case, the vector is also divided among processes.”
ru: МАТРИЧНЫЕ ВЫЧИСЛЕНИЯ. В горизонтальной схеме матрица делится между процессами по строкам. В вертикальной - по столбцам, вектор в этом случае также делится между процессами.

source: COMPUTER GRAPHICS AND IMAGE PROCESSING “It is assumed that the image is given in color or grayscale, with the input data being a one-dimensional array. Loading a real image is not required, but is allowed.”
ru: МАШИННАЯ ГРАФИКА И ОБРАБОТКА ИЗОБРАЖЕНИЙ. Считается, что изображение задано в цветном виде или оттенках серого, входные данные - одномерный массив. Загружать реальное изображение не требуется, но и не возбраняется.

source: SOLUTION OF A SYSTEM OF LINEAR ALGEBRAIC EQUATIONS
ru: РЕШЕНИЕ СИСТЕМЫ ЛИНЕЙНЫХ АЛГЕБРАИЧЕСКИХ УРАВНЕНИЙ

source: SORT ALGORITHMS
ru: АЛГОРИТМЫ СОРТИРОВКИ

source: GRAPH PROCESSING ALGORITHMS
ru: АЛГОРИТМЫ НА ГРАФАХ
