Repository: learning-process/parallel_programming_course
Catalog: docs/locale/*/LC_MESSAGES/common_information/report.po
Languages: ru

source: Report
ru: Отчёт

source: Overview and placement
ru: Общее и размещение

source: The report is a Markdown file placed inside your task directory: ``tasks/<last>_<initial>_<short>/report.md``.
ru: Отчёт — это Markdown‑файл в папке вашей задачи: ``tasks/<фамилия>_<инициал>_<краткое>/report.md``.

source: Presence of ``report.md`` is required to receive report (R) points for that task (see ``Points``).
ru: Наличие ``report.md`` обязательно для получения отчётных (R) баллов по этой задаче (см. «Баллы»).

source: Write the report in a concise, reproducible manner. Use English or Russian consistently.
ru: Пишите отчёт кратко и воспроизводимо. Используйте один язык последовательно (русский или английский).

source: Report points
ru: Баллы за отчёт

source: Completeness
ru: Наличие всех требуемых пунктов

source: Text Quality
ru: Качество текста

source: Formatting Quality
ru: Качество оформления

source: Total
ru: Всего

source: Recommended structure
ru: Рекомендуемая структура

source: Introduction (short context and goal)
ru: Введение (краткий контекст и цель)

source: Problem Statement (task definition and constraints)
ru: Постановка задачи (определение и ограничения)

source: Algorithm Description (baseline/sequential)
ru: Описание алгоритма (базового/последовательного)

source: Parallelization Scheme (MPI topology/data flow or threads scheduling)
ru: Схема распараллеливания (для MPI — топология/обмены, для потоков — декомпозиция и планирование)

source: Implementation Details per technology used (only those in your semester)
ru: Детали реализации по используемым технологиям (только требуемые в семестре)

source: Experimental Results - Environment (CPU, OS, compiler, build type; thread/process counts) - Execution time tables/plots; performance metrics (speedup/efficiency) - Correctness checks description
ru: Экспериментальные результаты — Окружение (CPU/OS/компилятор/тип сборки; числа потоков/процессов) — Таблицы/графики времени; метрики ускорения/эффективности — Описание проверки корректности

source: Conclusions (what worked, what didn’t, further work)
ru: Выводы (что получилось, ограничения, дальнейшие работы)

source: References (articles, docs; provide links)
ru: Источники (статьи, документация; ссылки)

source: Appendix (optional code snippets; keep readable)
ru: Приложение (небольшие фрагменты кода; сохраняйте читаемость)

source: Evaluation criteria
ru: Критерии оценки

source: Completeness - All items from the recommended structure are present and meaningful - Results include both correctness and performance evidence
ru: Полнота — все пункты из рекомендуемой структуры присутствуют и осмысленны — есть подтверждение корректности и результатов производительности

source: Text Quality - Clarity, coherence, correct terminology; acceptable language quality
ru: Качество текста — ясность, связность, корректная терминология; приемлемое качество языка

source: Formatting Quality - Proper Markdown headings, lists, tables, fenced code blocks - Figures/plots with captions and relative paths; readable formatting
ru: Качество оформления — корректные Markdown‑заголовки, списки, таблицы, блоки кода — рисунки/графики с подписями и относительными путями; читаемое форматирование

source: Notes
ru: Примечания

source: Reports are reviewed online in the Pull Request. The final grade is based on the submitted version that passes the review.
ru: Отчёты проверяются онлайн в Pull Request. Итоговая оценка ставится по версии, прошедшей ревью.

source: If the task is disabled at the end of semester (e.g., fails in master; see scoreboard “blue zone”), report points for that task are nullified.
ru: Если задача окажется в «синей зоне» к концу семестра (например, падение в master), отчётные баллы по этой задаче обнуляются.

source: Plagiarism is prohibited; identical or near‑duplicate reports will be rejected.
ru: Плагиат запрещён; совпадающие или почти совпадающие отчёты будут отклонены.

source: Markdown template (report.md)
ru: Шаблон Markdown (report.md)

source: Use the following skeleton as a starting point for your ``report.md``. Keep file paths relative to the task directory (for images/data).
ru: Используйте следующий скелет для вашего ``report.md``. Пути к файлам указывайте относительно папки задачи (для изображений/данных).
